<h1>Aprendendo Pandas parte 2.</h1>
<p></p>
Nessa segunda parte será focada na junção de dois dataframes, como lidar com dados faltantes e veremos mais algumas operações com Pandas e Numpy.

In [1]:
import numpy as np
import pandas as pd

<h2>Tratando Dados Faltantes</h2>

In [2]:
d = {'A':[1, 2, np.nan], 'B':[5, np.nan, np.nan], 'C':[1, 2, 3]}

In [3]:
df = pd.DataFrame(d)

In [4]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

Uma forma de tirar os NaN é usar o método .dropna(), esse método possui o parametro inplace e axis = 0, ou seja, vai excluir por linha e não coluna.

In [5]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [6]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

Outro parametro interessante o é thresh que exclui um linha/coluna se a quantidade de NaN for maior ou igual a n.

In [7]:
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [8]:
df.dropna(axis = 1, thresh = 2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

Outra forma de tratar dataframes como NaN é usar o método .fillna() que substitui/preenche os NaN por outro valor.

In [9]:
df.fillna(value = 'Fluminense')

            A           B  C
0           1           5  1
1           2  Fluminense  2
2  Fluminense  Fluminense  3

In [10]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

O parametro método preenche os NaN com algum método previamente conhecido. Existem 5 metodos para passara sendo p Default é o None. 
<p>Método para se usar no .fillna ‘backfill’, ‘bfill’, ‘pad’, ‘ffill’, None. Para mais informações acessar</p> https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.fillna.html

In [11]:
df.fillna(method = 'ffill')

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

<h2>Agrupando dados</h2>
<p>Nessa seção aprenderemos a agrupar dados e fazer operações com media, soma e variancia com esse grupamento</p>

In [12]:
data = {'Empresa': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
       'Nome': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Venda': [200, 120, 340, 124, 243, 350]}

In [13]:
df = pd.DataFrame(data)

In [14]:
df

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [15]:
df.groupby('Empresa')

In [16]:
grupo = df.groupby('Empresa')

In [17]:
grupo.sum()

         Venda
Empresa
FB         593
GOOG       320
MSFT       464

In [18]:
grupo.mean()

         Venda
Empresa
FB       296.5
GOOG     160.0
MSFT     232.0

In [19]:
grupo.var()

           Venda
Empresa
FB        5724.5
GOOG      3200.0
MSFT     23328.0

In [20]:
grupo.count()

         Nome  Venda
Empresa
FB          2      2
GOOG        2      2
MSFT        2      2

In [21]:
grupo.describe()

        Venda
        count   mean         std    min     25%    50%     75%    max
Empresa
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [22]:
grupo = df.groupby('Nome')

In [23]:
grupo.sum()

         Venda
Nome
Amy        340
Carl       243
Charlie    120
Sam        200
Sarah      350
Vanessa    124

In [24]:
grupo.mean()

         Venda
Nome
Amy        340
Carl       243
Charlie    120
Sam        200
Sarah      350
Vanessa    124

Método .groupby() continua retornando um dataframe, ou seja, todas operações já vista como .loc, .iloc, criar novas colunas e etc continua validos.

<h2>Mesclar, Juntar e Concatenar</h2>

In [25]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [26]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [27]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [28]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

<h3>Concatenação</h3>

Concatenação basicamente cola DataFrames. Tenha em mente que as dimensões devem corresponder ao longo do eixo que você está concatenando. Você pode usar pd.concat e passar uma lista de DataFrames para concatenar juntos:

Concatenado por conluna

In [29]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

Concatenando por linha

In [30]:
pd.concat([df1, df2, df3], axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

<h3>Mesclando</h3>

In [31]:
esquerda = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
direita = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [32]:
esquerda

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [33]:
direita

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

O método .merge serve para juntar dois dataframes que possuem um chave (key) em comum.

In [34]:
pd.merge(esquerda, direita, how = 'inner', on = 'key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

O parametro on indica qual chave será usada, já o how indica como será feito a junção, para melhor compreenção lembre o da seguinte regra:

* inner = Interseção das chaves
* outter = União das chaves
* left = Chaves da esquerda
* right = Chaves da direira

Por defualt o parametro how = 'inner'

In [35]:
esquerda = pd.DataFrame({'key': ['K0', 'K0', 'K1', 'K2'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
direita = pd.DataFrame({'key': ['K0', 'K0', 'K0', 'K0'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']})

In [36]:
pd.merge(esquerda, direita, on='key', how='outer')

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K0  A0  B0   C1   D1
2  K0  A0  B0   C2   D2
3  K0  A0  B0   C3   D3
4  K0  A1  B1   C0   D0
5  K0  A1  B1   C1   D1
6  K0  A1  B1   C2   D2
7  K0  A1  B1   C3   D3
8  K1  A2  B2  NaN  NaN
9  K2  A3  B3  NaN  NaN

In [37]:
pd.merge(esquerda, direita, on='key', how='left')

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K0  A0  B0   C1   D1
2  K0  A0  B0   C2   D2
3  K0  A0  B0   C3   D3
4  K0  A1  B1   C0   D0
5  K0  A1  B1   C1   D1
6  K0  A1  B1   C2   D2
7  K0  A1  B1   C3   D3
8  K1  A2  B2  NaN  NaN
9  K2  A3  B3  NaN  NaN

In [38]:
pd.merge(esquerda, direita, on='key', how='right')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K0  A1  B1  C0  D0
2  K0  A0  B0  C1  D1
3  K0  A1  B1  C1  D1
4  K0  A0  B0  C2  D2
5  K0  A1  B1  C2  D2
6  K0  A0  B0  C3  D3
7  K0  A1  B1  C3  D3

In [39]:
esquerda = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
direita = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

Data frames com chaves diferentes

In [40]:
pd.merge(esquerda, direita, on = ['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [41]:
pd.merge(esquerda, direita, on = ['key1', 'key2'], how = 'outer')

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [42]:
pd.merge(esquerda, direita, on = ['key1', 'key2'], how = 'left')

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [43]:
pd.merge(esquerda, direita, on = ['key1', 'key2'], how = 'right')

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

<h3>Juntando</h3>

In [44]:
esquerda = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

direita = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [45]:
esquerda

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [46]:
direita

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [47]:
esquerda.join(direita)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [48]:
direita.join(esquerda)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

<h3>Operações</h3>

In [49]:
df = pd.DataFrame({'col1':[1, 2, 3, 4], 'col2': [444, 555, 666, 444], 'col3': ['abc', 'def', 'ghi', 'xyz']})

Método .head() mostra somente os valores iniciais do dataframe

In [51]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

Método .unique() retorno o valores de uma coluna excluindo os valores repetidos. Esse método tambem existe no Numpy

In [53]:
df['col2'].unique()

array([444, 555, 666])

In [54]:
np.unique(df['col2'])

array([444, 555, 666])

Método .value_counts() conta o número de observações.

In [56]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

Aplicando uma função num dataframe, para isso usamos o método .apply()

In [68]:
def multi(x):
    return x*2

In [69]:
df['col1'].apply(multi)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [70]:
def expo_2(x):
    return x**2

In [72]:
df['col1'].apply(expo_2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

Podemos usar lambdas

In [73]:
df['col1'].apply(lambda x: x**2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [74]:
df['col1'].apply(lambda x: x**x)

0      1
1      4
2     27
3    256
Name: col1, dtype: int64

Deletando colunas

In [75]:
del df['col1']

In [76]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [77]:
df = pd.DataFrame({'col1':[1, 2, 3, 4], 'col2': [444, 555, 666, 444], 'col3': ['abc', 'def', 'ghi', 'xyz']})

Descobrindo nome da coluna e linha

In [78]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [79]:
df.index

RangeIndex(start=0, stop=4, step=1)

Método .sort_value() ordena os valores em ordem crescente com base numa coluna

In [80]:
df.sort_values(by = 'col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [81]:
df = pd.DataFrame({'col1':[1, 2, 3, np.nan], 
                   'col2': [np.nan, 555, 666, 444], 
                   'col3': ['abc', 'def', 'ghi', 'xyz']})

Método .pivot_table() transforma seu dataframe em um tabela dinamica com Multiindices. Esse método é interessante pois possui o parametros aggfunc que retorna um valor agregado que por Default é mean e fill_value que preenche os NaN que podem ser gerados.

In [88]:
 df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                     "bar", "bar", "bar", "bar"],
                    "B": ["one", "one", "one", "two", "two",
                         "one", "one", "two", "two"],
                    "C": ["small", "large", "large", "small",
                          "small", "large", "small", "small",
                          "large"],
                    "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                    "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})

In [89]:
df

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

In [91]:
df.pivot_table(values = 'D', index = ['A', 'B'], columns = 'C')

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    2.0    1.0
    two    NaN    3.0

In [92]:
df.pivot_table(values = 'D', index = ['A', 'B'], columns = 'C', aggfunc = sum)

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0

In [93]:
df.pivot_table(values = 'D', index = ['A', 'B'], columns = 'C', fill_value = 10)

C        large  small
A   B
bar one      4      5
    two      7      6
foo one      2      1
    two     10      3

**Fiquei atento pois muitos desses métodos podem ter o parametro inplace**

Lembrando tambem que ja foram visto algumas operações como .fillna(), dorpna() e filtrando valores como df[df['W'] > 0]